extend type ServiceLog {
  equpmentRecord: [EquipmentRecord!]!
    @relationship(type: "HAS_RECORD", direction: OUT)
}

extend type GatheringService {
  pulpits: Int
    @cypher(
      statement: """
      MATCH (this)-[:HAS_CAMPAIGN]->(:EquipmentCampaign)-[:HAS_RECORD]->(record:EquipmentRecord)
      MATCH (record)-[:HAS_EQUIPMENT_DATE]->(date:TimeGraph)
      WITH MAX(date.date) as lastDate, record limit 1
      MATCH (date {date:lastDate})<-[:HAS_EQUIPMENT_DATE]-(record)
      MATCH (record)-[:HAS*3]->(constituencyRecord:EquipmentRecord)
      RETURN sum(constituencyRecord.pulpits)
      """
    )
  offeringBags: Int
    @cypher(
      statement: """
      MATCH (this)-[:HAS_CAMPAIGN]->(campaign:EquipmentCampaign)-[:HAS_RECORD]->(record:EquipmentRecord)
      MATCH (record)-[:HAS_EQUIPMENT_DATE]->(date:TimeGraph)
      WITH  MAX(date.date) as lastDate, record limit 1
      MATCH (date:TimeGraph {date:lastDate})<-[:HAS_EQUIPMENT_DATE]-(record)
      MATCH (record)-[:HAS*5]->(fellowshipRecord:EquipmentRecord)
      return sum(fellowshipRecord.offeringBags)
      """
    )
}

extend type Stream {
  pulpits: Int
    @cypher(
      statement: """
      MATCH (this)-[:HAS_CAMPAIGN]->(:EquipmentCampaign)-[:HAS_RECORD]->(record:EquipmentRecord)
      MATCH (record)-[:HAS_EQUIPMENT_DATE]->(date:TimeGraph)
      WITH MAX(date.date) as lastDate, record limit 1
      MATCH (date {date:lastDate})<-[:HAS_EQUIPMENT_DATE]-(record)
      MATCH (record)-[:HAS*2]->(constituencyRecord:EquipmentRecord)
      RETURN sum(constituencyRecord.pulpits)
      """
    )
  offeringBags: Int
    @cypher(
      statement: """
      MATCH (this)-[:HAS_CAMPAIGN]->(campaign:EquipmentCampaign)-[:HAS_RECORD]->(record:EquipmentRecord)
      MATCH (record)-[:HAS_EQUIPMENT_DATE]->(date:TimeGraph)
      WITH  MAX(date.date) as lastDate, record limit 1
      MATCH (date:TimeGraph {date:lastDate})<-[:HAS_EQUIPMENT_DATE]-(record)
      MATCH (record)-[:HAS*4]->(fellowshipRecord:EquipmentRecord)
      return sum(fellowshipRecord.offeringBags)
      """
    )
}

extend type Council {
  pulpits: Int
    @cypher(
      statement: """
      MATCH (this)-[:HAS_CAMPAIGN]->(:EquipmentCampaign)-[:HAS_RECORD]->(record:EquipmentRecord)
       MATCH (record)-[:HAS_EQUIPMENT_DATE]->(date:TimeGraph)
       WITH MAX(date.date) as lastDate, record limit 1
       MATCH (date {date:lastDate})<-[:HAS_EQUIPMENT_DATE]-(record)
       MATCH (record)-[:HAS]->(constituencyRecord:EquipmentRecord)
       RETURN sum(constituencyRecord.pulpits)
      """
    )
  offeringBags: Int
    @cypher(
      statement: """
      MATCH (this)-[:HAS_CAMPAIGN]->(campaign:EquipmentCampaign)-[:HAS_RECORD]->(record:EquipmentRecord)
      MATCH (record)-[:HAS_EQUIPMENT_DATE]->(date:TimeGraph)
      WITH  MAX(date.date) as lastDate, record limit 1
      MATCH (date:TimeGraph {date:lastDate})<-[:HAS_EQUIPMENT_DATE]-(record)
      MATCH (record)-[:HAS*3]->(fellowshipRecord:EquipmentRecord)
      return sum(fellowshipRecord.offeringBags)
      """
    )
}

extend type Constituency {
  pulpits: Int
    @cypher(
      statement: """
      MATCH (this)-[:HAS_CAMPAIGN]->(:EquipmentCampaign)-[:HAS_RECORD]->(record:EquipmentRecord)
      MATCH (record)-[:HAS_EQUIPMENT_DATE]->(date:TimeGraph)
      WITH MAX(date.date) as lastDate, record
      MATCH (date {date:lastDate})<-[:HAS_EQUIPMENT_DATE]-(record:EquipmentRecord)
      RETURN record.pulpits limit 1
      """
    )
  offeringBags: Int
    @cypher(
      statement: """
      MATCH (this)-[:HAS_CAMPAIGN]->(campaign:EquipmentCampaign)-[:HAS_RECORD]->(record:EquipmentRecord)
      MATCH (record)-[:HAS_EQUIPMENT_DATE]->(date:TimeGraph)
      WITH  MAX(date.date) as lastDate, record limit 1
      MATCH (date:TimeGraph {date:lastDate})<-[:HAS_EQUIPMENT_DATE]-(record)
      MATCH (record)-[:HAS*2]->(fellowshipRecord:EquipmentRecord)
      return sum(fellowshipRecord.offeringBags)
      """
    )
  latestEquipmenRecord: EquipmentRecord
    @cypher(
      statement: """
       MATCH (this)-[:HAS_CAMPAIGN]->(:EquipmentCampaign)-[:HAS_HISTORY]->(:ServiceLog)-[:HAS_RECORD]->(record:EquipmentRecord)
      MATCH (record)-[:HAS_EQUIPMENT_DATE]->(date:TimeGraph)
      WITH MAX(date.date) as lastDate, record
      MATCH (date {date:lastDate})<-[:HAS_EQUIPMENT_DATE]-(record:EquipmentRecord)
      RETURN record limit 1
      """
    )
}

extend type Bacenta {
  offeringBags: Int
    @cypher(
      statement: """
      MATCH (this)-[:HAS_CAMPAIGN]->(campaign:EquipmentCampaign)-[:HAS_RECORD]->(record:EquipmentRecord)
      MATCH (record)-[:HAS_EQUIPMENT_DATE]->(date:TimeGraph)
      WITH  MAX(date.date) as lastDate, record limit 1
      MATCH (date:TimeGraph {date:lastDate})<-[:HAS_EQUIPMENT_DATE]-(record)
      MATCH (record)-[:HAS]->(fellowshipRecord:EquipmentRecord)
      return sum(fellowshipRecord.offeringBags)
      """
    )
}

extend type Fellowship {
  offeringBags: Int
    @cypher(
      statement: """
      MATCH (this)-[:HAS_CAMPAIGN]->(:EquipmentCampaign)-[:HAS_RECORD]->(record:EquipmentRecord)
      MATCH (record)-[:HAS_EQUIPMENT_DATE]->(date:TimeGraph)
      WITH MAX(date.date) as lastDate, record
      MATCH (date {date:lastDate})<-[:HAS_EQUIPMENT_DATE]-(record:EquipmentRecord)
      RETURN record.offeringBags  limit 1
      """
    )
  latestEquipmenRecord: EquipmentRecord
    @cypher(
      statement: """
      MATCH (this)-[:HAS_CAMPAIGN]->(:EquipmentCampaign)-[:HAS_RECORD]->(record:EquipmentRecord)
      MATCH (record)-[:HAS_EQUIPMENT_DATE]->(date:TimeGraph)
      WITH MAX(date.date) as lastDate, record
      MATCH (date {date:lastDate})<-[:HAS_EQUIPMENT_DATE]-(record:EquipmentRecord)
      RETURN record  limit 1
      """
    )
}

###### CAMPAIGN TYPES #######
type EquipmentRecord {
  id: ID!
  created_at: DateTime!
  equipmentDate: TimeGraph!
    @relationship(type: "HAS_EQUIPMENT_DATE", direction: OUT)
  offeringBags: Int
  pulpits: Int
  serviceLog: ServiceLog @relationship(type: "HAS_RECORD", direction: IN)
  constituencyRecord: EquipmentRecord @relationship(type: "HAS", direction: IN)
  church_name: String
    @auth(
      rules: [
        {
          roles: [
            "leaderFellowship"
            "leaderConstituency"
            "leaderCouncil"
            "leaderStream"
            "leaderGatheringService"
            "adminConstituency"
            "adminCouncil"
            "adminStream"
            "adminGatheringService"
          ]
        }
      ]
    )
    @cypher(
      statement: """
      MATCH (this)<-[:HAS_RECORD]-(:ServiceLog)<-[:HAS_HISTORY]-(:EquipmentCampaign)<-[:HAS_CAMPAIGN]-(church)
      WHERE church:Fellowship OR church:Bacenta OR church:Constituency OR church:Council OR church:Stream OR church:GatheringService
      UNWIND labels(church) AS church_name
      RETURN church.name + ' ' + church_name
      """
    )
}

# type ConstituencyEquipmentRecord implements EquipmentRecord {
#   id: ID!
#   created_at: DateTime!
#   equipmentDate: TimeGraph!
#   pulpits: Int!
#   serviceLog: ServiceLog @relationship(type: "HAS_RECORD", direction: IN)
#   fellowshipRecords: [EquipmentRecord!]!
#     @relationship(type: "HAS", direction: OUT)
# }

type EquipmentCampaign implements Campaign {
  id: ID!
  name: String!
    @cypher(
      statement: """
      MATCH (this)<-[:HAS_CAMPAIGN]-(church) WHERE church:Fellowship OR church:Bacenta OR church:Constituency OR church:Council OR church:Stream OR church:GatheringService
      UNWIND labels(church) AS churchLevel
      RETURN church.name+ ' ' +churchLevel + ' Equipment Campaign'
      """
    )
    @auth(
      rules: [
        {
          roles: [
            "leaderFellowship"
            "leaderConstituency"
            "leaderCouncil"
            "leaderStream"
            "leaderGatheringService"
            "adminConstituency"
            "adminCouncil"
            "adminStream"
            "adminGatheringService"
          ]
        }
      ]
    )
  type: String! @cypher(statement: "RETURN 'Equipment'")
  serviceLog: [ServiceLog!]! @relationship(type: "HAS_HISTORY", direction: OUT)
  fellowship: Fellowship @relationship(type: "HAS_CAMPAIGN", direction: IN)
  bacenta: Bacenta @relationship(type: "HAS_CAMPAIGN", direction: IN)
  constituency: Constituency @relationship(type: "HAS_CAMPAIGN", direction: IN)
  council: Council @relationship(type: "HAS_CAMPAIGN", direction: IN)
  stream: Stream @relationship(type: "HAS_CAMPAIGN", direction: IN)
  gatheringService: GatheringService
    @relationship(type: "HAS_CAMPAIGN", direction: IN)
  leader: Member @relationship(type: "LEADS", direction: IN)
  target: Target @relationship(type: "HAS_TARGET", direction: OUT)
}

extend type Mutation {
  CreateFellowshipEquipmentRecord(
    fellowshipRecordId: ID!
    offeringBags: Int!
  ): EquipmentRecord
    @auth(rules: [{ roles: ["leaderFellowship", "adminConstituency"] }])
    # @auth(rules: [{ roles: ["leaderFellowship", "adminConstituency"] }])
    @cypher(
      statement: """
      MATCH (fellowshipRecord:EquipmentRecord {id: $fellowshipRecordId})
       SET
       fellowshipRecord.offeringBags = $offeringBags
       RETURN fellowshipRecord
      """
    )

  CreateConstituencyEquipmentRecord(
    constituencyRecordId: ID!
    pulpits: Int!
  ): EquipmentRecord
    @auth(rules: [{ roles: ["adminConstituency", "leaderConstituency"] }])
    @cypher(
      statement: """
      MATCH (constituencyRecord:EquipmentRecord {id: $constituencyRecordId})
      set
      constituencyRecord.pulpits = $pulpits
      RETURN constituencyRecord
      """
    )



  CreateEquipmentCampaignDate(date: Date!): EquipmentCampaign
    @cypher(
      statement: """
      MATCH (gatheringService:GatheringService)-[:HAS_CAMPAIGN]->(EquipmentCampaign:EquipmentCampaign)
      MATCH (log:ServiceLog)<-[:HAS_HISTORY {current:true}]-(gatheringService)
      WITH log, gatheringService, EquipmentCampaign
      CREATE (gatheringServiceRecord:EquipmentRecord)
      SET
      gatheringServiceRecord.historyRecord = gatheringService.name + ' ' + ' Equipment Campaign created an Equipment Record on this '+datetime(),
      gatheringServiceRecord.id = apoc.create.uuid(),
      gatheringServiceRecord.date = date()
      MERGE (gatheringServiceRecord)<-[:HAS_RECORD]-(log)
      MERGE (equimpentDate:TimeGraph {date:$equipmentDate})
      MERGE (EquipmentCampaign)-[:HAS_RECORD]->(gatheringServiceRecord)
      MERGE (gatheringServiceRecord)-[:HAS_EQUIPMENT_DATE]->(equimpentDate)
      return log,gatheringService, gatheringServiceRecord;
      //Create Stream Equipment Record
      MATCH (stream:Stream)-[:HAS_CAMPAIGN]->(EquipmentCampaign:EquipmentCampaign)<-[:HAS]-(gatheringServiceCampaign:EquipmentCampaign)-[:HAS_RECORD]->(gatheringServiceRecord:EquipmentRecord)-[:HAS_EQUIPMENT_DATE]->(equimpentDate:TimeGraph {date:$equipmentDate})
      MATCH (log:ServiceLog)<-[:HAS_HISTORY {current:true}]-(stream)
      WITH log, stream, EquipmentCampaign, gatheringServiceRecord
      CREATE (streamRecord:EquipmentRecord)
      SET
      streamRecord.historyRecord = stream.name + ' ' + ' Equipment Campaign created an Equipment Record on this '+datetime(),
      streamRecord.id = apoc.create.uuid(),
      streamRecord.date = date()
      MERGE (streamRecord)<-[:HAS_RECORD]-(log)
      MERGE (equimpentDate:TimeGraph {date:$equipmentDate})
      MERGE (EquipmentCampaign)-[:HAS_RECORD]->(streamRecord)
      MERGE (streamRecord)-[:HAS_EQUIPMENT_DATE]->(equimpentDate)
      MERGE (gatheringServiceRecord)-[:HAS]->(streamRecord)
      return log,stream, streamRecord limit 2;
      //Create Council Equipment Record
      MATCH (council:Council)-[:HAS_CAMPAIGN]->(EquipmentCampaign:EquipmentCampaign)<-[:HAS]-(streamCampaign:EquipmentCampaign)-[:HAS_RECORD]->(streamRecord:EquipmentRecord)-[:HAS_EQUIPMENT_DATE]->(equimpentDate:TimeGraph {date:$equipmentDate})
      MATCH (log:ServiceLog)<-[:HAS_HISTORY {current:true}]-(council)
      WITH log, council, EquipmentCampaign, streamRecord
      CREATE (councilRecord:EquipmentRecord)
      SET
      councilRecord.historyRecord = council.name + ' ' + ' Equipment Campaign created an Equipment Record on this '+datetime(),
      councilRecord.id = apoc.create.uuid(),
      councilRecord.date = date()
      MERGE (councilRecord)<-[:HAS_RECORD]-(log)
      MERGE (equimpentDate:TimeGraph {date:$equipmentDate})
      MERGE (EquipmentCampaign)-[:HAS_RECORD]->(councilRecord)
      MERGE (councilRecord)-[:HAS_EQUIPMENT_DATE]->(equimpentDate)
      MERGE (streamRecord)-[:HAS]->(councilRecord)
      return log,council, councilRecord limit 2;
      //Create Constituency Equipment Record
      MATCH (constituency:Constituency)-[:HAS_CAMPAIGN]->(EquipmentCampaign:EquipmentCampaign)<-[:HAS]-(councilCampaign:EquipmentCampaign)-[:HAS_RECORD]->(councilRecord:EquipmentRecord)-[:HAS_EQUIPMENT_DATE]->(equimpentDate:TimeGraph {date:$equipmentDate})
      MATCH (log:ServiceLog)<-[:HAS_HISTORY {current:true}]-(constituency)
      WITH log, constituency, EquipmentCampaign, councilRecord
      CREATE (constituencyRecord:EquipmentRecord)
      SET
      constituencyRecord.historyRecord = constituency.name + ' ' + 'Equipment Campaign created an Equipment Record on this '+datetime(),
      constituencyRecord.id = apoc.create.uuid(),
      constituencyRecord.date = date(),
      constituencyRecord.pulpits = 0
      MERGE (constituencyRecord)<-[:HAS_RECORD]-(log)
      MERGE (equimpentDate:TimeGraph {date:$equipmentDate})
      MERGE (EquipmentCampaign)-[:HAS_RECORD]->(constituencyRecord)
      MERGE (constituencyRecord)-[:HAS_EQUIPMENT_DATE]->(equimpentDate)
      MERGE (councilRecord)-[:HAS]->(constituencyRecord)
      return log,constituency, constituencyRecord limit 2;
      //Create Bacenta Equipment Record
      MATCH (bacenta:Bacenta)-[:HAS_CAMPAIGN]->(EquipmentCampaign:EquipmentCampaign)<-[:HAS]-(constituencyCampaign:EquipmentCampaign)-[:HAS_RECORD]->(constituencyRecord:EquipmentRecord)-[:HAS_EQUIPMENT_DATE]->(equimpentDate:TimeGraph {date:$equipmentDate})
      MATCH (log:ServiceLog)<-[:HAS_HISTORY {current:true}]-(bacenta)
      WITH log, bacenta, EquipmentCampaign, constituencyRecord
      CREATE (bacentaRecord:EquipmentRecord)
      SET
      bacentaRecord.historyRecord = bacenta.name + ' ' + 'Equipment Campaign created an Equipment Record on this '+datetime(),
      bacentaRecord.id = apoc.create.uuid(),
      bacentaRecord.date = date()
      MERGE (bacentaRecord)<-[:HAS_RECORD]-(log)
      MERGE (equimpentDate:TimeGraph {date:$equipmentDate})
      MERGE (EquipmentCampaign)-[:HAS_RECORD]->(bacentaRecord)
      MERGE (bacentaRecord)-[:HAS_EQUIPMENT_DATE]->(equimpentDate)
      MERGE (constituencyRecord)-[:HAS]->(bacentaRecord)
      return log,bacenta, bacentaRecord limit 2;
      //Create Fellowship Campaigns
      MATCH (fellowship:Fellowship)-[:HAS_CAMPAIGN]->(EquipmentCampaign:EquipmentCampaign)<-[:HAS]-(bacentaCampaign:EquipmentCampaign)-[:HAS_RECORD]->(bacentaRecord:EquipmentRecord)-[:HAS_EQUIPMENT_DATE]->(equimpentDate:TimeGraph {date:$equipmentDate})
      MATCH (log:ServiceLog)<-[:HAS_HISTORY {current:true}]-(fellowship)
      WITH log, fellowship, EquipmentCampaign, bacentaRecord
      CREATE (fellowshipRecord:EquipmentRecord)
      SET
      fellowshipRecord.historyRecord = fellowship.name + ' ' + 'Equipment Campaign created an Equipment Record on this '+datetime(),
      fellowshipRecord.id = apoc.create.uuid(),
      fellowshipRecord.date = date(),
      fellowshipRecord.offeringBags = 0
      MERGE (fellowshipRecord)<-[:HAS_RECORD]-(log)
      MERGE (equimpentDate:TimeGraph {date:$equipmentDate})
      MERGE (EquipmentCampaign)-[:HAS_RECORD]->(fellowshipRecord)
      MERGE (fellowshipRecord)-[:HAS_EQUIPMENT_DATE]->(equimpentDate)
      MERGE (bacentaRecord)-[:HAS]->(fellowshipRecord)
      return log,fellowship, fellowshipRecord limit 2;
      """
    )
}

extend type Query {
  latestEquipmentRecord(churchId: ID!): EquipmentRecord!
    @auth(
      rules: [
        {
          roles: [
            "leaderConstituency"
            "leaderFellowship"
            "leaderBacenta"
            "leaderCouncil"
            "leaderStream"
            "leaderGatheringService"
            "adminConstituency"
            "leaderFellowship"
            "adminCouncil"
            "adminStream"
            "adminGatheringService"
          ]
        }
      ]
    )
    @cypher(
      statement: """
      MATCH (church {id:$churchId})
      WHERE church:Constituency OR church:Council OR church:Stream OR church:GatheringService OR church:Bacenta OR church:Fellowship
      MATCH (church)-[:HAS_CAMPAIGN]->(:EquipmentCampaign)-[:HAS_HISTORY]->(:ServiceLog)-[:HAS_RECORD]->(record:EquipmentRecord)
      MATCH (record)-[:HAS_EQUIPMENT_DATE]->(date:TimeGraph)
      WITH max(date.date) as lastDate, record
      MATCH (date {date:lastDate})<-[:HAS_EQUIPMENT_DATE]-(record:EquipmentRecord)
      RETURN record limit 1
      """
    )
}
