{
  "string": {
    "subscription": "\n\nIf you do not understand this message or you believe it has been sent in error, kindly contact your bishop's admin for clarification.\n\nPlease do not respond to this email address as it is unmonitored and will not receive a reply.\n\nOn behalf of the Resident Bishop,\nRegards\nThe Administrator\nFirst Love Center HQ\nAccra"
  },
  "html": {
    "subscription": "If you do not understand this message or you believe it has been sent in error, kindly contact your bishop's admin for clarification.<br/><br/>Please do not respond to this email address as it is unmonitored and will not receive a reply.<br/><br/>On behalf of the Resident Bishop,<br/>Regards<br/>The Administrator<br/>First Love Center HQ<br/>Accra",
    "helpdesk": "<b><a href='https://reports.firstlovecenter.com/helpdesk'>this website</a></b>"
  },
  "error": {
    "repeatingTreasurers": "You cannot choose the same treasurer twice!",
    "vacation_cannot_fill_service": "You cannnot have service if you are on vacation. Please conntact your admin!",
    "no_double_form_filling": "You have already filled your service form this week!",
    "no_duplicate_email_or_whatsapp": "A member with this email address/whatsapp number already exists in the database"
  },
  "arrivalsSMS": {
    "less_than_8": "Proverbs 27:23 (KJV)\n\nBe thou diligent to know the state of thy flocks,and look well to thy herds.\n\nToday's bussing will not merit a top up. Your attendance was ",
    "no_bussing_cost": "We just counted your attendance. Since you filled 0 for bussing cost, you will not receive a  top up today.",
    "no_busses_to_pay_for": "We just counted your attendance. Since you indicated that you didn't use a bus today, you  will not receive a top up.",
    "swell_top_up_p1": "Congratulations on exceeding your target! We just counted your attendance. You will receive an amount of ",
    "swell_top_up_p2": " GHS as a top up when you arrive. Your attendance was ",
    "normal_top_up_p1": "Your attendance has just been counted at the terminal. You will receive a top up of ",
    "normal_top_up_p2": " GHS when you arrive. Today you bussed ",
    "normal_no_top_up": "Your attendance has just been counted at the terminal. Today you bussed ",
    "swell_no_top_up": "Congratulations on exceeding your target! Your attendance has just been counted at the terminal. Today you bussed ",
    "cheaper_bussing_today": "Today's bussing cost is cheaper than usual. Congratulations! You will receive full payment of ",
    "cheaper_bussing_today_p2": " GHS when you arrive. Your bussing attendance was ",
    "you_have_arrived": "We have just confirmed your arrival at the terminal. If you are eligible for bussing support you should receive it very soon. God bless you!"
  }
}
