{
  "string": {
    "subscription": "\n\nIf you do not understand this message or you believe it has been sent in error, kindly contact your council admin for clarification.\n\nPlease do not respond to this email address as it is unmonitored and will not receive a reply.\n\nOn behalf of the Lead Pastor,\nRegards\nThe Administrator\nFirst Love Center HQ\nAccra"
  },
  "html": {
    "subscription": "If you do not understand this message or you believe it has been sent in error, kindly contact your council admin for clarification.<br/><br/>Please do not respond to this email address as it is unmonitored and will not receive a reply.<br/><br/>On behalf of the Lead Pastor,<br/>Regards<br/>The Administrator<br/>First Love Center HQ<br/>Accra",
    "helpdesk": "<b><a href='https://rebrand.ly/synago-help'>this website</a></b>"
  },
  "error": {
    "repeatingTreasurers": "You cannot choose the same treasurer twice!",
    "vacation_cannot_fill_service": "You cannnot have service if you are on vacation. Please conntact your admin!",
    "no_double_form_filling": "You have already filled your service form this week!",
    "no_duplicate_email_or_whatsapp": "A member with this email address/whatsapp number already exists in the database",
    "not_stream_service_day": "You cannot fill this form today. It is not your stream service day"
  },
  "arrivalsSMS": {
    "less_than_8": "Proverbs 27:23 (KJV)\n\nBe thou diligent to know the state of thy flocks,and look well to thy herds.\n\nToday's bussing will not merit a top up. Your attendance was ",
    "no_bussing_cost": "We just counted your attendance. Since there is no cost to the church, you will not receive a top up today. Confirmed attendance is ",
    "no_busses_to_pay_for": "We just counted your attendance. Since you indicated that you didn't use a bus today, you  will not receive a top up. Confirmed attendance is ",
    "normal_top_up_p1": "We just counted your attendance at the terminal. You will receive a top up of ",
    "normal_top_up_p2": " GHS. Today's attendance was ",
    "normal_no_top_up": "We just counted your attendance at the terminal. Today you bussed ",
    "bacenta_demoted_to_ic_p1": "Sorry to inform you that you have not met the quota of 8 for the last 4 weeks and your bacenta ",
    "bacenta_demoted_to_ic_p2": " is being demoted to Red status.",
    "bacenta_graduated_p1": "Congrats, your bacenta ",
    "bacenta_graduated_p2": " has just graduated from Red status to Green status. Keep on working for the Lord!"
  },
  "equipment": {
    "notify_fellowship_leaders_sms": "Hi Fellowship Leader,\nNote: Equipment Campaign Data Collection is ongoing. You are required to fill forms on the State of the Flock Admin Portal. Check your mail for more info.",
    "notify_governorship_overseers_sms": "Hi CO,\nNote: Equipment Campaign Data Collection is ongoing. You are required to fill forms on the State of the Flock Admin Portal. Check your mail for more info.",
    "notify_governorship_overseers_email": "Please be informed that it is time for another Equipment Campaign Data Collection! Please ensure that you and your fellowship leaders have filled the appropirate forms. The deadline for filling these forms is",
    "notify_email_p1": "<br/><br/>When you log in, please go to Campaigns on your menu bar and follow the prompts to fill your details as a ",
    "notify_email_p2": " for equipment campaign.<br/><br/>We encourage you to ensure that all forms are filled <b>by the deadline</b>. Thank you!</p>",
    "notify_fellowship_leaders_email": "Please be informed that it is time for another Equipment Campaign Data Collection! Please ensure that you have filled the appropirate forms. The deadline for filling these forms is",
    "overseer_text": "Governorship Overseer",
    "fellowship_text": "Fellowship Leader"
  }
}
